app/views/lists/show.html.erb

SELECT 1 AS one FROM "lists" WHERE "lists"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1 ORDER BY "lists"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    <h1><%= @list.name %></h1>
    <% if current_user.lists.any? ||  @list.editors %>

SELECT "users".* FROM "users" INNER JOIN "list_visitors" ON "users"."id" = "list_visitors"."user_id" WHERE "list_visitors"."list_id" = $1  [["list_id", 1]]
---
      <% end %>
      <% if user_signed_in? && (current_user == @list.user || @list.editors.include?(current_user)) %>

SELECT "users".* FROM "users" INNER JOIN "list_visitors" ON "users"."id" = "list_visitors"."user_id" WHERE "list_visitors"."list_id" = $1  [["list_id", 1]]
---
  </div>
  <% if user_signed_in? && (current_user == @list.user || @list.editors.include?(current_user)) %>

SELECT "lists".* FROM "lists" WHERE "lists"."slug" = $1 LIMIT $2  [["slug", "nn"], ["LIMIT", 1]]
---
          <div style="text-align:center; margin-top:20px; margin-bottom:40px;">
            <button type="button" id="load-more-references" data-type="references" class="button dark" style="<%= 'display:none;' if @other_references.length < 10 %>" <%= "data-slug='#{@list.slug}'" if @list&.persisted? %>><%= t('list.load_more_references') %></button>