app/views/oeuvres/_card.html.erb

            </div>
            <% if card.domaine.present? %>
---
SELECT "domaines".* FROM "domaines" WHERE "domaines"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

      <p class="subtitle-card">
        <%= card.designers.map(&:nom_designer).join(', ') %>
---
SELECT "designers".* FROM "designers" INNER JOIN "designers_oeuvres" ON "designers"."id" = "designers_oeuvres"."designer_id" WHERE "designers_oeuvres"."oeuvre_id" = $1  [["oeuvre_id", 3291]]