app/views/oeuvres/_oeuvre.html.erb

      <p class="subtitle-card">
        <% oeuvre.designers.each do |designer| %>
---
SELECT "designers".* FROM "designers" INNER JOIN "designers_oeuvres" ON "designers"."id" = "designers_oeuvres"."designer_id" WHERE "designers_oeuvres"."oeuvre_id" = $1  [["oeuvre_id", 3061]]

        <%end%>
        <% if @oeuvre.domaine.present? %>
---
SELECT "domaines".* FROM "domaines" WHERE "domaines"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

        <p class="subtitle-card">
          <% oeuvre.designers.each do |designer| %>
---
SELECT "designers".* FROM "designers" INNER JOIN "designers_oeuvres" ON "designers"."id" = "designers_oeuvres"."designer_id" WHERE "designers_oeuvres"."oeuvre_id" = $1  [["oeuvre_id", 3061]]