app/views/oeuvres/_oeuvre_card.html.erb

SELECT "domaines".* FROM "domaines"
---
      <div class="inner-card-oeuvre">
        <p class="domaine-card-oeuvre"><%= oeuvre.domaines.map(&:domaine).join(', ') %></p>