app/views/oeuvres/search.html.erb

SELECT "domaines".* FROM "domaines"
---
  <div class="flex-category">
    <% Domaine.all.each do |domaine| %>

SELECT "countries".* FROM "countries"
---
              <div class="inner-card-designer">
                <% designer.countries.each do |country| %>

SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1 ORDER BY "oeuvres"."nom_oeuvre" ASC  [["validation", true]]
---
      <div class="flex-oeuvre" id="oeuvre-cards">
        <% @oeuvres = Oeuvre.where(validation: true).order(:nom_oeuvre) %>