app/views/designers/_card.html.erb

SELECT "countries".* FROM "countries" INNER JOIN "designer_countries" ON "countries"."id" = "designer_countries"."country_id" WHERE "designer_countries"."designer_id" = $1  [["designer_id", 1581]]
---
      <p class="subtitle-card">
        <%= card.countries.map(&:name).join(' & ') %>