app/views/designers/_card.html.erb

SELECT "domaines".* FROM "domaines" INNER JOIN "designers_domaines" ON "domaines"."id" = "designers_domaines"."domaine_id" WHERE "designers_domaines"."designer_id" = $1 ORDER BY "domaines"."id" ASC LIMIT $2  [["designer_id", 1581], ["LIMIT", 1]]
SELECT 1 AS one FROM "domaines" INNER JOIN "designers_domaines" ON "domaines"."id" = "designers_domaines"."domaine_id" WHERE "designers_domaines"."designer_id" = $1 LIMIT $2  [["designer_id", 1581], ["LIMIT", 1]]
SELECT COUNT(*) FROM "domaines" INNER JOIN "designers_domaines" ON "domaines"."id" = "designers_domaines"."domaine_id" WHERE "designers_domaines"."designer_id" = $1  [["designer_id", 1581]]
---
  <div class="card" data-id="<%= card.id %>">
    <% if card.domaines.any? %>
      <% if card.domaines.size == 1 %>
        <%# Un seul domaine, utilisez sa couleur %>
        <div class="bg-card" style="background-color: <%= card.domaines.first.couleur %>;">

SELECT "domaines".* FROM "domaines" INNER JOIN "designers_domaines" ON "domaines"."id" = "designers_domaines"."domaine_id" WHERE "designers_domaines"."designer_id" = $1  [["designer_id", 1581]]
---
                  <div class="domaine-flex-card">
                    <% card.domaines.each do |domaine| %>

SELECT "countries".* FROM "countries" INNER JOIN "designer_countries" ON "countries"."id" = "designer_countries"."country_id" WHERE "designer_countries"."designer_id" = $1  [["designer_id", 1581]]
---
        <div class="container-text-card">
          <% if card.countries.present? %>