app/views/designers/_designer.html.erb

SELECT "countries".* FROM "countries" INNER JOIN "designer_countries" ON "countries"."id" = "designer_countries"."country_id" WHERE "designer_countries"."designer_id" = $1  [["designer_id", 1668]]
---
        <% end %>
        <% designer.countries.each do |country| %>

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <% if designer.user_id.present? %>
                <% user = User.find_by(id: designer.user_id) %>

SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1  [["validation", true]]
---
      <div class="next-card">
        <% designer_oeuvres = @designer.oeuvres.where(validation: true) %>

SELECT "designers".* FROM "designers" WHERE "designers"."validation" = $1  [["validation", true]]
---
            <div class="horizontal-wrapper">
              <% designers = Designer.where(validation: true).where.not(id: @designer.id).order("RANDOM()").limit(5) %>