app/views/designers/_designer_card.html.erb

SELECT "countries".* FROM "countries" INNER JOIN "designer_countries" ON "countries"."id" = "designer_countries"."country_id" WHERE "designer_countries"."designer_id" = $1  [["designer_id", 1668]]
---
      <div class="inner-card-designer">
        <% designer.countries.each do |country| %>