app/views/designers/_form.html.erb

SELECT "countries".* FROM "countries" ORDER BY "countries"."country" ASC
---
      <div>
        <%= form.collection_select :country_1, Country.order(:country), :id, :country, { include_blank: "Aucun pays", prompt: "Sélectionner un pays", selected: @country_1 }, { class: "form-control select2", data: { placeholder: "Ajouter un pays" }, id: "country_1", name: "designer[country_ids][]" } %>