app/helpers/application_helper.rb

SELECT "designers".* FROM "designers" WHERE "designers"."validation" = $1  [["validation", true]]
SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1  [["validation", true]]
---
  def linkify_designer_names_and_oeuvres(text)
    designers = Designer.where(validation: true)
    oeuvres = Oeuvre.where(validation: true)

    designers.each do |designer|
      next if designer.nom_designer.nil?

      # Remplacer les noms de designers par des liens
      text = text.gsub(/\b(#{Regexp.escape(designer.nom_designer)})\b/i) do |match|
        "<a style=\"color:#202020; font-weight:500;\" class=\"underline\" href='/designers/#{designer.id}'>#{match}</a>"
      end
    end

    oeuvres.each do |oeuvre|