app/controllers/designers_controller.rb

  def index
    @designers = Designer.where(validation: true).order("RANDOM()").limit(2)
---
SELECT "designers".* FROM "designers" WHERE "designers"."validation" = $1 ORDER BY RANDOM() LIMIT $2  [["validation", true], ["LIMIT", 2]]