app/controllers/designers_controller.rb

  def index
    # --- OPTIMISATION ---
    designers = Designer.where(validation: true)
                        .includes(:domaines, :countries, designer_images: { file_attachment: :blob })
                        .order("RANDOM()")
                        .limit(9)

    studios = Studio.where(validation: true)
                    .includes(:domaines, studio_images: { file_attachment: :blob })
                    .order("RANDOM()")
                    .limit(1)

    raw_items = (designers + studios).shuffle

    @current_page = 'accueil'

    # --- NOUVELLE LOGIQUE DE PUB (Poids + Ciblage) ---
    # 1. On récupère les pubs actives et pertinentes pour l'utilisateur
    candidate_ads = Ad.currently_active.includes(image_attachment: :blob, image_mobile_attachment: :blob).relevant_for(current_user)
---
SELECT "countries".* FROM "countries" INNER JOIN "designer_countries" ON "countries"."id" = "designer_countries"."country_id" WHERE "designer_countries"."designer_id" = $1  [["designer_id", 1581]]
SELECT "domaines".* FROM "domaines" INNER JOIN "designers_domaines" ON "domaines"."id" = "designers_domaines"."domaine_id" WHERE "designers_domaines"."designer_id" = $1 ORDER BY "domaines"."id" ASC LIMIT $2  [["designer_id", 1581], ["LIMIT", 1]]

  def load_more
    # Récupération des IDs déjà chargés
    loaded_designer_ids = params[:loaded_designer_ids]&.split(',')&.map(&:to_i) || []
    loaded_studio_ids = params[:loaded_studio_ids]&.split(',')&.map(&:to_i) || []

    if loaded_designer_ids.empty? && params[:loaded_ids].present?
       loaded_designer_ids = params[:loaded_ids]&.split(',')&.map(&:to_i) || []
    end

    # Chargement des items suivants
    new_designers = Designer.where(validation: true)
                         .where.not(id: loaded_designer_ids)
                         .includes(:domaines, :countries, designer_images: { file_attachment: :blob })
                         .order("RANDOM()")
                         .limit(3)

    new_studios = Studio.where(validation: true)
                         .where.not(id: loaded_studio_ids)
                         .includes(:domaines, studio_images: { file_attachment: :blob })
                         .order("RANDOM()")
                         .limit(1)

    mixed_items = (new_designers + new_studios).shuffle

    # Gestion Pubs (Paramètres)
    items_until_next_ad = params[:items_until_next_ad].present? ? params[:items_until_next_ad].to_i : rand(AD_FREQUENCY_RANGE)
---
SELECT 1 AS one FROM "domaines" INNER JOIN "designers_domaines" ON "domaines"."id" = "designers_domaines"."domaine_id" WHERE "designers_domaines"."designer_id" = $1 LIMIT $2  [["designer_id", 1581], ["LIMIT", 1]]