app/controllers/lists_controller.rb

  def show
    @current_page = 'listes'
    @list = List.friendly.find(params[:slug])
    if @list.share_token.present? && @list.share_token == params[:share_token]
      render :show
    elsif @list.user == current_user || @list.editors.include?(current_user) || @list.visitors.include?(current_user)
---
SELECT "lists".* FROM "lists" WHERE "lists"."slug" = $1 LIMIT $2  [["slug", "nn"], ["LIMIT", 1]]
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1 ORDER BY "lists"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "lists" WHERE "lists"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_list
    @list = List.friendly.find(params[:slug])
---
SELECT "lists".* FROM "lists" WHERE "lists"."slug" = $1 LIMIT $2  [["slug", "nn"], ["LIMIT", 1]]