app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" INNER JOIN "list_visitors" ON "lists"."id" = "list_visitors"."list_id" WHERE "list_visitors"."user_id" = $1  [["user_id", 1]]
---
  def index
    @lists = current_user.lists.includes(:references)

SELECT "designers".* FROM "designers" WHERE "designers"."validation" = $1 ORDER BY "designers"."nom" ASC  [["validation", true]]
---
  def show
    @current_page = 'listes'
    @countries = Country.where(id: DesignerCountry.select(:country_id))
                        .or(Country.where(id: StudioCountry.select(:country_id)))
                        .distinct.order(:country)
    @notions = Notion.all

    # Designers
    selected_designer_ids = @list.designer_ids
    @selected_designers = Designer.where(id: selected_designer_ids, validation: true).includes(:countries).order(:nom)