app/controllers/lists_controller.rb

SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1 ORDER BY "oeuvres"."nom_oeuvre" ASC  [["validation", true]]
---
  def show
    @current_page = 'listes'
    @countries = Country.where(id: DesignerCountry.select(:country_id))
                        .or(Country.where(id: StudioCountry.select(:country_id)))
                        .distinct.order(:country)
    @notions = Notion.all

    # Designers
    selected_designer_ids = @list.designer_ids
    @selected_designers = Designer.where(id: selected_designer_ids, validation: true).order(:nom)
    @other_designers = Designer.where(validation: true)
                               .where.not(id: selected_designer_ids)
                               .order(:nom)
                               .page(params[:designers_page]).per(10)

    selected_studio_ids = @list.studio_ids
    @selected_studios = Studio.where(id: selected_studio_ids, validation: true).order(:nom)
    @other_studios = Studio.where(validation: true)
                           .where.not(id: selected_studio_ids)
                           .order(:nom)
                           .page(params[:studios_page]).per(10)

    # Œuvres
    selected_oeuvre_ids = @list.oeuvre_ids
    @selected_oeuvres = Oeuvre.where(id: selected_oeuvre_ids, validation: true).order(:nom_oeuvre)