app/controllers/oeuvres_controller.rb

  def index
    @oeuvres = Oeuvre.where(validation: true).limit(2).order("RANDOM()")
---
SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1 ORDER BY RANDOM() LIMIT $2  [["validation", true], ["LIMIT", 2]]

  def load_more
    offset = params[:offset].to_i
    limit = 2
    loaded_ids = params[:loaded_ids].split(',').map(&:to_i) if params[:loaded_ids]

    @oeuvres = Oeuvre.where(validation: true)
                     .where.not(id: loaded_ids)
                     .order("RANDOM()")
                     .offset(offset)
                     .limit(limit)
---
SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1 AND "oeuvres"."id" NOT IN ($2, $3) ORDER BY RANDOM() LIMIT $4 OFFSET $5  [["validation", true], ["id", 3106], ["id", 3203], ["LIMIT", 2], ["OFFSET", 2]]

  def search
    @current_page = 'recherche'
    query = params[:query].to_s.strip.downcase
    @works = Oeuvre.where(validation: true).pluck(:nom_oeuvre) + Designer.where(validation: true).pluck(:nom_designer)

    if !query.blank?
      # Recherche exacte
      @work = Oeuvre.find_by('LOWER(nom_oeuvre) = ? AND validation = ?', query, true)
      @designer = Designer.find_by('LOWER(nom_designer) = ? AND validation = ?', query, true)
---
SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1 ORDER BY "oeuvres"."nom_oeuvre" ASC  [["validation", true]]
SELECT "designers".* FROM "designers" WHERE "designers"."validation" = $1 ORDER BY "designers"."nom" ASC  [["validation", true]]

  def load_more_oeuvres
    @oeuvres = Oeuvre.where(validation: true).order(:nom_oeuvre).offset(params[:offset]).limit(8)
---
SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."validation" = $1 ORDER BY "oeuvres"."nom_oeuvre" ASC  [["validation", true]]