app/controllers/search_controller.rb

  def autocomplete
    query = params[:query].to_s.strip

    if query.length < 2
      return render json: { error: "Query too short" }, status: :bad_request
    end

    # 1. Domaines : Insensible aux accents
    domaines = Domaine.where("unaccent(domaine) ILIKE unaccent(?)", "%#{query}%").limit(5)

    # 2. Designers : Insensible aux accents (Prénom, Nom, Concaténation)
    designers = Designer.where(validation: true).where(
      "unaccent(prenom) ILIKE unaccent(:q) OR unaccent(nom) ILIKE unaccent(:q) OR unaccent(prenom || ' ' || nom) ILIKE unaccent(:q) OR unaccent(nom || ' ' || prenom) ILIKE unaccent(:q)",
      q: "%#{query}%"
    ).includes(designer_images: { file_attachment: :blob }).limit(5)

    # 3. Œuvres : Insensible aux accents
    oeuvres = Oeuvre.where(validation: true)
                    .where("unaccent(nom_oeuvre) ILIKE unaccent(?)", "%#{query}%")
                    .includes(oeuvre_images: { file_attachment: :blob }, designers: [])
                    .limit(5)
---
SELECT "oeuvres".* FROM "oeuvres" WHERE "oeuvres"."id" IN ($1, $2, $3)  [["id", 3109], ["id", 3210], ["id", 3232]]